const adjectives = [
  '희망찬', '조용한', '기운찬', '차분한', '용맹한', '활기찬', '순수한', '긍정적인', '유쾌한', '단호한',
  '용감한', '따뜻한', '화려한', '은은한', '예리한', '다정한', '신비로운', '섬세한', '우아한', '절묘한',
  '기발한', '창의적인', '정열적인', '정직한', '활발한', '화끈한', '세련된', '똑똑한', '매혹적인', '지혜로운',
  '평화로운', '상냥한', '강렬한', '사랑스러운', '고요한', '대담한', '영리한', '눈부신', '멋진', '잔잔한',
  '낭만적인', '풍부한', '힘찬', '독립적인', '매력적인', '단단한', '깔끔한', '부드러운', '순진한', '젊은',
  '빛나는', '맑은', '부끄러운', '깨끗한', '행복한', '쓸쓸한', '소박한', '희귀한', '능동적인', '가벼운',
  '따사로운', '포근한', '명랑한', '사나운', '신속한', '날카로운', '포악한', '환상적인', '고독한', '냉철한',
  '무서운', '고급스러운', '우스운', '기묘한', '이국적인', '지적인', '엄격한', '유연한', '불사신의', '열정적인',
  '순박한', '충성스러운', '지속적인', '뛰어난', '근면한', '엄청난', '놀라운', '미묘한', '대단한', '신비한',
  '힘겨운', '적극적인', '통찰력있는', '충만한', '침착한', '여유로운', '장엄한', '낯익은', '조화로운', '단순한',
  '웅장한', '믿음직한', '차가운', '철저한', '과감한', '결단력있는', '현명한', '엄숙한', '모험적인', '기민한',
  '무심한', '깨달은', '호기심많은', '비범한', '온화한', '강인한', '독창적인', '분명한', '흥미로운', '평탄한',
  '도전적인', '기쁨있는', '존경스러운', '빠른', '친절한', '근사한', '끈기있는', '가치있는'
];


const nouns = [
  '나무', '하늘', '바람', '별', '달', '꽃', '강', '산', '바다', '구름',
  '새', '돌', '불', '눈', '사자', '늑대', '호랑이', '고양이', '강아지', '나비',
  '물결', '숲', '비', '천둥', '번개', '햇빛', '안개', '호수', '연못', '밥',
  '도시', '마을', '성', '용', '기사', '왕', '여왕', '천사', '악마', '그림자',
  '꿈', '희망', '사랑', '운명', '별빛', '고독', '우주', '신화', '전설', '추억',
  '영웅', '빛', '어둠', '시간', '미래', '과거', '영혼', '마법', '법사', '전사',
  '모험', '탐험', '여행', '길', '물고기', '새벽', '황혼', '정원', '계곡', '폭포',
  '불꽃', '유성', '태양', '사막', '빙하', '얼음', '불안', '평화', '행복', '용기',
  '사막', '물방울', '노을', '돌풍', '조각', '세상', '가시', '심장', '자유', '방울',
  '반짝임', '별자리', '추위', '따스함', '지평선', '깊이', '속삭임', '폭풍', '해변', '숲속',
  '우정', '사랑의 불꽃', '용의 심장', '미소', '다람쥐', '회오리바람', '자연', '생명', '불멸', '현실',
  '환상', '달빛', '별무리', '비밀', '미로', '잿더미', '정의', '분노', '기적', '파도',
  '모래성', '행성', '유령', '너구리', '불씨', '고래', '심연', '오아시스', '꽃잎', '거울',
  '지혜', '독수리', '잔물결', '축복', '황소', '불꽃놀이', '천국', '나선', '비둘기', '사람'
];


// size 가 2 의 제곱일때 가능! bitwise 를 이용해서 부동소수점 연산을 하지 않음.
function getRandomIntBitwise(size: number) {
  return Math.floor(Math.random() * size); // 0부터 15까지의 정수
}

function getRandomAdjective() {
  return adjectives[getRandomIntBitwise(adjectives.length)];
}

function getRandomNoun(){
  return nouns[getRandomIntBitwise(nouns.length)];
}

function getRandomBrightColor(): string {
  const hue = Math.floor(Math.random() * 360);
  const saturation = Math.floor(Math.random() * 50) + 50;
  const lightness = Math.floor(Math.random() * 30) + 50;

  return `hsl(${hue}, ${saturation}%, ${lightness}%)`;
}

export { getRandomAdjective, getRandomNoun, getRandomBrightColor };
